---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceMatchOptions.#ctor(Autodesk.Revit.DB.ExternalResourceType)
source: html/9a5fe509-751a-ba8c-4aed-6f63b3b9c718.htm
---
# Autodesk.Revit.DB.ExternalResourceMatchOptions.#ctor Method

Constructs new instance with specified resource type.

## Syntax (C#)
```csharp
public ExternalResourceMatchOptions(
	ExternalResourceType resourceType
)
```

## Parameters
- **resourceType** (`Autodesk.Revit.DB.ExternalResourceType`) - The desired resource type.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null